Revit 2027 API
FlowConvergenceCharacteristic Enumeration
 The flow convergence characteristic of the analytical segment cluster.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FlowConvergenceCharacteristic
Public Enumeration FlowConvergenceCharacteristic
public enum class FlowConvergenceCharacteristic
type FlowConvergenceCharacteristic
Members
Member name | Value | Description
Converge | 1 |  Multile flow paths are converged into one segment.
Diverge | 2 |  The flow is diverged from one segment into multiple paths.
Undefined | 0 |  The flow convergence characteristic is undefined.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace